
export interface Position {
  name: string;
  position: string;
  url: string;
  startDate: string;
  endDate?: string;
  summary?: string;
  highlights?: string[];
}

const work: Position[] = [
  {
    name: 'برنامه نویس فرانت اند ',
    position: 'فریلنسر',
    url: 'https://smileidentity.com',
    startDate: '01/09/1402',
    summary: `به‌عنوان برنامه‌نویس فرانت‌اند فریلنسر در پروژه‌های متنوع وب فعالیت داشته‌ام.
در این مسیر، تجربه‌ی طراحی و پیاده‌سازی رابط‌های کاربری واکنش‌گرا و مدرن را با استفاده از HTML، CSS، JavaScript و کتابخانه‌هایی مانند React.js کسب کرده‌ام.
تمرکزم بر ایجاد تجربه‌ی کاربری روان، طراحی تمیز و رعایت اصول بهینه‌سازی عملکرد صفحات است.`,
    highlights: [
      'طراحی رابط کاربری با رویکرد Mobile-first و Responsive Design',
      'توسعه‌ی کامپوننت‌های داینامیک با استفاده از React.js',
      'پیاده‌سازی ارتباط با APIهای بک‌اند و مدیریت داده‌ها.',
      'استفاده از ابزارهایی مانند Git، Figma و sass در فرآیند توسعه.',
      'همکاری با کارفرماها برای طراحی و اجرای پروژه‌های سفارشی.',
    ],
  },
  {
    name: 'برنامه نویس فرانت اند',
    position: 'javascript',
    url: 'https://rnad.ir/',
    startDate: '10/07/1401',
    endDate: '30/08/1402',

    summary:
      'در شرکت آرناد به‌عنوان برنامه‌نویس پاره‌وقت JavaScript فعالیت داشتم.در این مدت در توسعه و بهبود بخش‌های مختلف پروژه‌های وب شرکت نقش داشتم و بر روی طراحی رابط کاربری، بهینه‌سازی عملکرد سمت کاربر و ارتباط با APIهای سمت سرور تمرکز داشتم.',
    highlights: [
      'توسعه و نگهداری رابط‌های کاربری با استفاده از HTML، CSS و JavaScript',
      'همکاری با تیم بک‌اند برای ارتباط مؤثر بین کلاینت و سرور',
      'بهینه‌سازی کدها برای افزایش سرعت بارگذاری و تجربه کاربری بهتر',
      'رفع باگ‌ها و افزودن قابلیت‌های جدید بر اساس نیازهای پروژه  ',
    ],
  },
];

export default work;
